var sjzd_hqcllx = {
	"0": "实值深度X%即行权",
	"1": "实值X元即行权"
};

var sjzd_xqkzkg = {
	"0": "不自动行权",
	"1": "自动行权"
};

var sjzd_jybk = {
	"10": "股票现货",
	"12": "上海个股期权"
};

var sjzd_zqyw ={
	"400": "买入开仓",
	"401": "卖出平仓",
	"402": "卖出开仓",
	"403": "买入平仓",
	"404": "备兑开仓",
	"405": "备兑平仓",
	"406": "认购行权",
	"407": "认沽行权",
	"408": "证券锁定",
	"409": "证券解锁"
};

var sjzd_zqywhd ={
	"100": "委托申报",
	"101": "撤单申报",
	"130": "限价GFD",
	"131": "限价FOK",
	"132": "市价剩转限价GFD",
	"133": "市价FOK",
	"134": "市价FC",
	"200": "买入认购开仓",
	"201": "卖出认购平仓",
	"202": "买入认沽开仓",
	"203": "卖出认沽平仓",
	"204": "卖出认购开仓",
	"205": "买入认购平仓",
	"206": "卖出认沽开仓",
	"207": "买入认沽平仓",
	"208": "备兑认购开仓",
	"209": "备兑认购平仓",
	"210": "认购行权行权方",
	"211": "认购行权被行权方(非备兑)",
	"212": "认沽行权行权方",
	"213": "认沽行权被行权方",
	"218": "非备兑对冲",
	"219": "备兑对冲",
	"214": "认购行权被行权方(备兑)"
};


var sjzd_wtzt ={
	"0": "未报",
	"1": "正报",
	"2": "已报",
	"3": "已报待撤",
	"4": "部成待撤",
	"5": "部撤",
	"6": "已撤",
	"7": "部成已撤",
	"8": "已成",
	"9": "废单",
	"A": "待报"
};

var sjzd_wtyx ={
	"0": "无效",
	"1": "有效"
};

var sjzd_cdbz ={
	"F": "正常",
	"T": "撤单"
};

var sjzd_mmbz ={
	"1": "买入",
	"2": "卖出"
}

var sjzd_kpbz ={
	"O": "开仓",
	"C": "平仓",
	"X": "行权"
}

var sjzd_bdbz ={
	"1": "备兑",
	" ": "非备兑"
}

var sjzd_wtlb ={
	"0":"限价GFD",
	"OPA":"限价即时全部成交否则撤单",
	"OPB":"市价即时成交剩余撤单",
	"OPC":"市价即时全部成交否则撤单",
	"OPD":"市价剩余转限价",
	"OTE":"期权行权",
	"OTU":"备兑证券划转"
}